dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDom_bf.h
/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_OFF (12u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_OFF (13u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_OFF (14u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_OFF (15u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_OFF (16u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_OFF (17u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_OFF (18u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_OFF (19u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_OFF (20u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_OFF (21u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_OFF (22u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_OFF (23u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI8 */
#define IFX_DOM_TIDSTAT_TIDMCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI8 */
#define IFX_DOM_TIDSTAT_TIDMCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI8 */
#define IFX_DOM_TIDSTAT_TIDMCI8_OFF (24u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI9 */
#define IFX_DOM_TIDSTAT_TIDMCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI9 */
#define IFX_DOM_TIDSTAT_TIDMCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI9 */
#define IFX_DOM_TIDSTAT_TIDMCI9_OFF (25u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI10 */
#define IFX_DOM_TIDSTAT_TIDMCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI10 */
#define IFX_DOM_TIDSTAT_TIDMCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI10 */
#define IFX_DOM_TIDSTAT_TIDMCI10_OFF (26u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI11 */
#define IFX_DOM_TIDSTAT_TIDMCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI11 */
#define IFX_DOM_TIDSTAT_TIDMCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI11 */
#define IFX_DOM_TIDSTAT_TIDMCI11_OFF (27u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_OFF (0u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_OFF (1u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_OFF (2u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_OFF (3u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_OFF (4u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_OFF (5u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_OFF (6u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_OFF (7u)

